// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя). 
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Enter the number: ");
int number = Console.ReadLine();
Console.Write("Square of the number is ");
Console.WriteLine(nuintmber*number);
